local-setup/hey-tests/results/remote-raw-100-16000-15-07-23_23-38-47

Summary:
  Total:	3.6082 secs
  Slowest:	3.6081 secs
  Fastest:	2.6022 secs
  Average:	3.1346 secs
  Requests/sec:	27.7148
  
  Total data:	1700 bytes
  Size/request:	17 bytes

Response time histogram:
  2.602 [1]	|■■
  2.703 [3]	|■■■■■■
  2.803 [10]	|■■■■■■■■■■■■■■■■■■■■■
  2.904 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  3.005 [9]	|■■■■■■■■■■■■■■■■■■■
  3.105 [3]	|■■■■■■
  3.206 [10]	|■■■■■■■■■■■■■■■■■■■■■
  3.306 [19]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.407 [18]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.507 [4]	|■■■■■■■■
  3.608 [11]	|■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 2.7399 secs
  25% in 2.8790 secs
  50% in 3.2204 secs
  75% in 3.3425 secs
  90% in 3.5275 secs
  95% in 3.5278 secs
  99% in 3.6081 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.4722 secs, 2.6022 secs, 3.6081 secs
  DNS-lookup:	0.1207 secs, 0.1112 secs, 0.1414 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0001 secs
  resp wait:	2.6622 secs, 2.0662 secs, 3.1465 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [200]	100 responses



---


Summary:
  Total:	2.3298 secs
  Slowest:	2.3286 secs
  Fastest:	1.2920 secs
  Average:	1.6286 secs
  Requests/sec:	85.8438
  
  Total data:	3400 bytes
  Size/request:	17 bytes

Response time histogram:
  1.292 [1]	|
  1.396 [87]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.499 [12]	|■■■■■■
  1.603 [15]	|■■■■■■■
  1.707 [10]	|■■■■■
  1.810 [15]	|■■■■■■■
  1.914 [11]	|■■■■■
  2.018 [13]	|■■■■■■
  2.121 [13]	|■■■■■■
  2.225 [8]	|■■■■
  2.329 [15]	|■■■■■■■


Latency distribution:
  10% in 1.3103 secs
  25% in 1.3425 secs
  50% in 1.5083 secs
  75% in 1.9067 secs
  90% in 2.1384 secs
  95% in 2.2511 secs
  99% in 2.3286 secs

Details (average, fastest, slowest):
  DNS+dialup:	1.0237 secs, 1.2920 secs, 2.3286 secs
  DNS-lookup:	0.2745 secs, 0.2441 secs, 0.3073 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.5851 secs, 0.2554 secs, 1.0438 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	200 responses



---


Summary:
  Total:	3.6827 secs
  Slowest:	3.6816 secs
  Fastest:	0.4902 secs
  Average:	2.0416 secs
  Requests/sec:	108.6173
  
  Total data:	6800 bytes
  Size/request:	17 bytes

Response time histogram:
  0.490 [1]	|■
  0.809 [50]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.128 [40]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.448 [40]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.767 [33]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.086 [42]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.405 [38]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.724 [39]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.043 [41]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.362 [39]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.682 [37]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 0.7189 secs
  25% in 1.1939 secs
  50% in 2.0532 secs
  75% in 2.8651 secs
  90% in 3.3542 secs
  95% in 3.5207 secs
  99% in 3.6532 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.4013 secs, 0.4902 secs, 3.6816 secs
  DNS-lookup:	0.1629 secs, 0.1056 secs, 0.1952 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0063 secs
  resp wait:	1.6160 secs, 0.2378 secs, 3.0899 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0010 secs

Status code distribution:
  [200]	400 responses



---


Summary:
  Total:	7.1550 secs
  Slowest:	7.1531 secs
  Fastest:	0.5267 secs
  Average:	3.8145 secs
  Requests/sec:	111.8094
  
  Total data:	13600 bytes
  Size/request:	17 bytes

Response time histogram:
  0.527 [1]	|
  1.189 [82]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.852 [83]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.515 [81]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.177 [79]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.840 [82]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.502 [73]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  5.165 [79]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  5.828 [81]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  6.490 [82]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  7.153 [77]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 1.1361 secs
  25% in 2.1365 secs
  50% in 3.7951 secs
  75% in 5.4928 secs
  90% in 6.4730 secs
  95% in 6.7903 secs
  99% in 7.0630 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.5480 secs, 0.5267 secs, 7.1531 secs
  DNS-lookup:	0.2081 secs, 0.0995 secs, 0.2576 secs
  req write:	0.0004 secs, 0.0000 secs, 0.0055 secs
  resp wait:	3.1894 secs, 0.2623 secs, 6.2766 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [200]	800 responses



---


Summary:
  Total:	3.0892 secs
  Slowest:	3.0879 secs
  Fastest:	0.8542 secs
  Average:	1.9783 secs
  Requests/sec:	323.7089
  
  Total data:	17000 bytes
  Size/request:	17 bytes

Response time histogram:
  0.854 [1]	|
  1.078 [97]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.301 [89]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.524 [100]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.748 [108]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.971 [106]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.194 [87]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.418 [114]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.641 [105]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.865 [107]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.088 [86]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 1.0798 secs
  25% in 1.4409 secs
  50% in 1.9710 secs
  75% in 2.5136 secs
  90% in 2.8416 secs
  95% in 2.9411 secs
  99% in 3.0522 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.6786 secs, 0.8542 secs, 3.0879 secs
  DNS-lookup:	0.3563 secs, 0.2622 secs, 0.3863 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	1.2985 secs, 0.3135 secs, 2.5497 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	1000 responses



---


Summary:
  Total:	5.2527 secs
  Slowest:	4.1856 secs
  Fastest:	0.3603 secs
  Average:	1.8857 secs
  Requests/sec:	380.7577
  
  Total data:	34000 bytes
  Size/request:	17 bytes

Response time histogram:
  0.360 [1]	|
  0.743 [84]	|■■■■■■
  1.125 [266]	|■■■■■■■■■■■■■■■■■■■
  1.508 [287]	|■■■■■■■■■■■■■■■■■■■■
  1.890 [339]	|■■■■■■■■■■■■■■■■■■■■■■■■
  2.273 [563]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.655 [171]	|■■■■■■■■■■■■
  3.038 [123]	|■■■■■■■■■
  3.421 [85]	|■■■■■■
  3.803 [53]	|■■■■
  4.186 [28]	|■■


Latency distribution:
  10% in 0.8664 secs
  25% in 1.3814 secs
  50% in 1.9028 secs
  75% in 2.2348 secs
  90% in 2.9041 secs
  95% in 3.3577 secs
  99% in 3.8596 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.2287 secs, 0.3603 secs, 4.1856 secs
  DNS-lookup:	0.1233 secs, 0.0000 secs, 0.2857 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0018 secs
  resp wait:	1.6360 secs, 0.2248 secs, 4.1854 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	2000 responses



---


Summary:
  Total:	8.9326 secs
  Slowest:	5.0197 secs
  Fastest:	0.0817 secs
  Average:	1.8933 secs
  Requests/sec:	447.7974
  
  Total data:	68000 bytes
  Size/request:	17 bytes

Response time histogram:
  0.082 [1]	|
  0.576 [199]	|■■■■■■
  1.069 [413]	|■■■■■■■■■■■■■
  1.563 [474]	|■■■■■■■■■■■■■■■
  2.057 [1219]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.551 [1239]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.045 [227]	|■■■■■■■
  3.538 [90]	|■■■
  4.032 [68]	|■■
  4.526 [54]	|■■
  5.020 [16]	|■


Latency distribution:
  10% in 0.8480 secs
  25% in 1.5050 secs
  50% in 1.9513 secs
  75% in 2.2507 secs
  90% in 2.6257 secs
  95% in 3.2134 secs
  99% in 4.2758 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0859 secs, 0.0817 secs, 5.0197 secs
  DNS-lookup:	0.0479 secs, 0.0000 secs, 0.2281 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0015 secs
  resp wait:	1.7955 secs, 0.0815 secs, 4.7587 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	4000 responses



---


Summary:
  Total:	17.7872 secs
  Slowest:	7.6137 secs
  Fastest:	0.0857 secs
  Average:	2.0021 secs
  Requests/sec:	449.7624
  
  Total data:	136000 bytes
  Size/request:	17 bytes

Response time histogram:
  0.086 [1]	|
  0.838 [278]	|■■■
  1.591 [1986]	|■■■■■■■■■■■■■■■■■■■■■■■
  2.344 [3509]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.097 [1763]	|■■■■■■■■■■■■■■■■■■■■
  3.850 [296]	|■■■
  4.602 [120]	|■
  5.355 [22]	|
  6.108 [8]	|
  6.861 [11]	|
  7.614 [6]	|


Latency distribution:
  10% in 1.2114 secs
  25% in 1.5405 secs
  50% in 1.9030 secs
  75% in 2.4060 secs
  90% in 2.8647 secs
  95% in 3.1863 secs
  99% in 4.3603 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0593 secs, 0.0857 secs, 7.6137 secs
  DNS-lookup:	0.0318 secs, 0.0000 secs, 0.2787 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0017 secs
  resp wait:	1.9400 secs, 0.0855 secs, 7.1026 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0010 secs

Status code distribution:
  [200]	8000 responses



---


Summary:
  Total:	33.3082 secs
  Slowest:	5.9633 secs
  Fastest:	0.0716 secs
  Average:	1.9438 secs
  Requests/sec:	480.3628
  
  Total data:	272000 bytes
  Size/request:	17 bytes

Response time histogram:
  0.072 [1]	|
  0.661 [265]	|■
  1.250 [935]	|■■■■■
  1.839 [7361]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.428 [4596]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  3.017 [1756]	|■■■■■■■■■■
  3.607 [577]	|■■■
  4.196 [277]	|■■
  4.785 [118]	|■
  5.374 [98]	|■
  5.963 [16]	|


Latency distribution:
  10% in 1.3699 secs
  25% in 1.5593 secs
  50% in 1.7963 secs
  75% in 2.1948 secs
  90% in 2.7513 secs
  95% in 3.2795 secs
  99% in 4.6161 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0472 secs, 0.0716 secs, 5.9633 secs
  DNS-lookup:	0.0132 secs, 0.0000 secs, 0.2403 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0066 secs
  resp wait:	1.8962 secs, 0.0715 secs, 5.7304 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [200]	16000 responses



---