local-setup/hey-tests/results/remote-raw-100-32000-16-07-23_01-25-38

Summary:
  Total:	8.5720 secs
  Slowest:	8.5706 secs
  Fastest:	7.3799 secs
  Average:	8.0447 secs
  Requests/sec:	11.6659
  
  Total data:	1700 bytes
  Size/request:	17 bytes

Response time histogram:
  7.380 [1]	|■
  7.499 [9]	|■■■■■■■■■■■■■
  7.618 [6]	|■■■■■■■■■
  7.737 [8]	|■■■■■■■■■■■■
  7.856 [11]	|■■■■■■■■■■■■■■■■
  7.975 [11]	|■■■■■■■■■■■■■■■■
  8.094 [6]	|■■■■■■■■■
  8.213 [17]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  8.332 [4]	|■■■■■■
  8.452 [0]	|
  8.571 [27]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 7.5077 secs
  25% in 7.7871 secs
  50% in 8.0796 secs
  75% in 8.4640 secs
  90% in 8.5380 secs
  95% in 8.5441 secs
  99% in 8.5706 secs

Details (average, fastest, slowest):
  DNS+dialup:	2.4248 secs, 7.3799 secs, 8.5706 secs
  DNS-lookup:	0.7675 secs, 0.7579 secs, 0.7883 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0006 secs
  resp wait:	5.6196 secs, 4.4083 secs, 7.2172 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [200]	100 responses



---


Summary:
  Total:	2.1517 secs
  Slowest:	2.1500 secs
  Fastest:	0.8416 secs
  Average:	1.3871 secs
  Requests/sec:	92.9517
  
  Total data:	3400 bytes
  Size/request:	17 bytes

Response time histogram:
  0.842 [1]	|■
  0.972 [39]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.103 [19]	|■■■■■■■■■■■■■■■■■■■
  1.234 [29]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.365 [19]	|■■■■■■■■■■■■■■■■■■■
  1.496 [18]	|■■■■■■■■■■■■■■■■■■
  1.627 [15]	|■■■■■■■■■■■■■■■
  1.757 [14]	|■■■■■■■■■■■■■■
  1.888 [12]	|■■■■■■■■■■■■
  2.019 [18]	|■■■■■■■■■■■■■■■■■■
  2.150 [16]	|■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 0.9253 secs
  25% in 1.0050 secs
  50% in 1.3128 secs
  75% in 1.7493 secs
  90% in 1.9873 secs
  95% in 2.0750 secs
  99% in 2.1496 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.6174 secs, 0.8416 secs, 2.1500 secs
  DNS-lookup:	0.2091 secs, 0.1759 secs, 0.2409 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.7692 secs, 0.3897 secs, 1.3315 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0011 secs

Status code distribution:
  [200]	200 responses



---


Summary:
  Total:	4.7765 secs
  Slowest:	4.7754 secs
  Fastest:	2.1685 secs
  Average:	3.3237 secs
  Requests/sec:	83.7439
  
  Total data:	6800 bytes
  Size/request:	17 bytes

Response time histogram:
  2.168 [1]	|
  2.429 [0]	|
  2.690 [95]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.951 [87]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.211 [31]	|■■■■■■■■■■■■■
  3.472 [25]	|■■■■■■■■■■■
  3.733 [37]	|■■■■■■■■■■■■■■■■
  3.993 [34]	|■■■■■■■■■■■■■■
  4.254 [32]	|■■■■■■■■■■■■■
  4.515 [26]	|■■■■■■■■■■■
  4.775 [32]	|■■■■■■■■■■■■■


Latency distribution:
  10% in 2.6341 secs
  25% in 2.6973 secs
  50% in 3.0910 secs
  75% in 3.9207 secs
  90% in 4.4098 secs
  95% in 4.6124 secs
  99% in 4.7359 secs

Details (average, fastest, slowest):
  DNS+dialup:	1.7732 secs, 2.1685 secs, 4.7754 secs
  DNS-lookup:	0.2417 secs, 0.1812 secs, 0.2847 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0010 secs
  resp wait:	1.3049 secs, 0.6065 secs, 2.2006 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	400 responses



---


Summary:
  Total:	8.3217 secs
  Slowest:	8.3202 secs
  Fastest:	2.6601 secs
  Average:	5.2799 secs
  Requests/sec:	96.1347
  
  Total data:	13600 bytes
  Size/request:	17 bytes

Response time histogram:
  2.660 [1]	|
  3.226 [15]	|■■■
  3.792 [83]	|■■■■■■■■■■■■■■■■
  4.358 [203]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.924 [129]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  5.490 [65]	|■■■■■■■■■■■■■
  6.056 [67]	|■■■■■■■■■■■■■
  6.622 [62]	|■■■■■■■■■■■■
  7.188 [66]	|■■■■■■■■■■■■■
  7.754 [8]	|■■
  8.320 [101]	|■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 3.7412 secs
  25% in 4.1510 secs
  50% in 4.7221 secs
  75% in 6.3522 secs
  90% in 8.0858 secs
  95% in 8.0915 secs
  99% in 8.2708 secs

Details (average, fastest, slowest):
  DNS+dialup:	1.9935 secs, 2.6601 secs, 8.3202 secs
  DNS-lookup:	0.3817 secs, 0.3028 secs, 0.4264 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0008 secs
  resp wait:	3.0480 secs, 1.8241 secs, 4.9773 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [200]	800 responses



---


Summary:
  Total:	20.0099 secs
  Slowest:	16.7881 secs
  Fastest:	12.6636 secs
  Average:	13.9858 secs
  Requests/sec:	49.9752
  
  Total data:	16779 bytes
  Size/request:	17 bytes

Response time histogram:
  12.664 [1]	|
  13.076 [206]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  13.489 [0]	|
  13.901 [333]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  14.313 [171]	|■■■■■■■■■■■■■■■■■■■■■
  14.726 [0]	|
  15.138 [226]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  15.551 [0]	|
  15.963 [0]	|
  16.376 [46]	|■■■■■■
  16.788 [4]	|


Latency distribution:
  10% in 12.7402 secs
  25% in 13.6457 secs
  50% in 13.8296 secs
  75% in 14.9061 secs
  90% in 15.0588 secs
  95% in 16.0523 secs
  99% in 16.0610 secs

Details (average, fastest, slowest):
  DNS+dialup:	9.5227 secs, 12.6636 secs, 16.7881 secs
  DNS-lookup:	2.3952 secs, 2.2815 secs, 2.4380 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0028 secs
  resp wait:	3.4701 secs, 1.6654 secs, 7.8201 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	987 responses

Error distribution:
  [13]	Get "https://fibonacci-behavior.grogu.hosts.pve": context deadline exceeded (Client.Timeout exceeded while awaiting headers)



---